{
  "figura.docs.globals.extura": "The Extura object that contains some random stuff. Only visible if it's enabled in the settings.",
  "figura.docs.globals.add_script": "(Extura) Allows you to add, edit or remove scripts from your avatar.\nAccepts 2 strings, if the second string is nil, the script is unloaded. Note this will NOT remove events",
  "figura.docs.globals.get_scripts": "(Extura) Returns a table of script names.",
  "figura.docs.globals.get_script": "(Extura) Returns the contents of a script or nil if the script doesn't exist.",
  "figura.config.use_secure_cloud": "(Extura) Secure Cloud",
  "figura.config.use_secure_cloud.tooltip": "Whether to use a Secure Connection for the cloud",
  "figura.config.block_cloud": "(Extura) Disable cloud",
  "figura.config.block_cloud.tooltip": "Disable Figura's multiplayer features",
  "figura.docs.world.get_spawn_point": "(Extura) Returns a vector with the coordinates of the world spawn",
  "figura.docs.world.isChunkLoaded": "(Extura) Returns whether a chunk is loaded at the given block position",
  "figura.docs.world.get_nearby_entities": "(Extura) Returns entities near the given block position",
  "figura.docs.world.raycast_entity": "(Extura > linetraceEntity) Returns the entity and pos of a linetrace.",
  "figura.docs.world.raycast_block": "(Extura > linetraceBlock) Returns the block, side, and pos of a linetrace",
  "figura.docs.world.linetraceBlock": "(Extura) Returns the block, side, and pos of a linetrace",
  "figura.docs.world.linetraceEntity": "(Extura) Returns the entity and pos of a linetrace",
  "figura.config.extura": "Extura - Advanced",
  "figura.config.extura.tooltip": "Extura settings",
  "figura.config.dangerous": "Extura - DANGEROUS | ALLOWS AVATARS TO DO DANGEROUS THINGS | EXTURA IS NOT RESPONSIBLE FOR DAMAGE CAUSED BY USING THIS!",
  "figura.config.helper_errors": "Enable helper errors",
  "figura.config.helper_errors.tooltip": "Enables the game throwing errors for extra things to help preventing confusing errors later",
  "figura.config.expose_extura_api": "Expose Extura API",
  "figura.config.expose_extura_api.tooltip": "Expose the Extura API to *ALL* Figura avatars",
  "figura.config.expose_java_api": "Expose Java API",
  "figura.config.expose_java_api.tooltip": "Expose the Java API to *YOUR* Figura avatar.",
  "figura.config.annual_cache_deletion": "Delete cache weekly",
  "figura.config.annual_cache_deletion.tooltip": "Delete cached avatars after 7 days",
  "figura.config.expose_http": "Expose HTTP",
  "figura.config.expose_http.tooltip": "Exposes extura.getHttp to *ALL* Figura avatars",
  "figura.config.expose_sensitive_libraries": "Enable hacking you",
  "figura.config.expose_sensitive_libraries.tooltip": "Exposes io, os, debug and extura.getHttp to *YOUR* Figura avatar. If you do not know what this means DO NOT ENABLE THIS. This will allow any equipped avatars to run ANY program on your computer and edit ANY file on your computer",

  "figura.config.get_blocks_limit": "Unlimited world.getBlocks",
  "figura.config.get_blocks_limit.tooltip": "Toggles if scripts can bypass the 8 block limit of world.getBlocks",

  "figura.config.get_target_limit": "Unlimited entity:getTarget",
  "figura.config.get_target_limit.tooltip": "Toggles if scripts can bypass the 20 block limit of entity.getTargetedBlock and entity.getTargetedEntity",

  "figura.config.use_global_scripts": "Global Scripts",
  "figura.config.use_global_scripts.tooltip": "Toggles if scripts are loaded from the `global_scripts` directory in your Figura folder. Note that they can override normal scripts if they have the same path/name",

  "figura.config.use_mc_host_resolver": "(Extura) Use host resolver for Cloud",
  "figura.config.use_mc_host_resolver.tooltip": "Toggles if Minecraft's host resolver is used. Normal Figura uses this. Disabling this will allow ports and subdirs to be used",

  "figura.docs.avatar.set_nbt": "(Extura) Set nbt of object at the path\n* First argument is the path, if a name contains a dot, use '\\\\.'\n* Second argument is the object to replace with\n* Third argument is the type, use this if you need a specific type\nValid types are: float, int, short, double, string, bool, boolean, bytearray, null, nil",
  "figura.docs.avatar.get_size_limit": "(Extura) Get the size limit of the avatar from the backend",

  "figura.docs.host.allow_extura_cheats": "(Extura) Returns whether functions like host:setVelocity will work.\n Returns true if on a local server, permission level is above 2 or player has an objective named 'extura_can_cheat'",
  "figura.docs.host.upload_avatar": "(Extura) Uploads your current avatar to the backend and then reloads it",
  "figura.docs.host.reload_avatar": "(Extura) Reloads the avatar of the entity UUID provided. If no UUID is provided then it'll reload your avatar",
  "figura.docs.host.load_local_avatar": "(Extura) Loads the avatar from the specified path. If no path is provided, current avatar is unloaded.",
  "figura.docs.host.set_pose": "(Extura) Set the player's pose",
  "figura.docs.host.set_player_movement": "(Extura) Set if the player can move normally",
  "figura.docs.host.get_player_movement": "(Extura) Get if the player can move normally",
  "figura.docs.host.drop_item": "(Extura - Requires host.allowExturaCheats() to be true) Drops the player's item",
  "figura.docs.host.start_riding": "(Extura - Requires host.allowExturaCheats() to be true) Force the player to ride a vehicle\n* First argument is the entity to ride, if nil is provided then player will dismount instead",
  "figura.docs.host.override_player_movement": "(Extura) Lock a specific input to a state,\n* first argument is the input('up', 'down', 'left', 'right', 'jump', or 'shift')\n* second argument is the state, true, false or nil to unlock",
  "figura.docs.host.set_velocity": "(Extura - Requires host.allowExturaCheats() to be true) Sets the player's velocity",
  "figura.docs.host.set_position": "(Extura - Requires host.allowExturaCheats() to be true) Sets the player's position",
  "figura.docs.host.set_natural_forces": "(Extura - Requires host.allowExturaCheats() to be true) Sets if the player is effected by gravity and drag",
  "figura.docs.host.set_gravity": "(Extura - Requires host.allowExturaCheats() to be true) Sets if the player is effected by gravity",
  "figura.docs.host.set_shader_pack_name": "(Extura) Sets the currently selected shader pack, an empty value will select the internal shader",
  "figura.docs.host.iris_save_config": "(Extura) Saves Iris's config",
  "figura.docs.host.iris_reload": "(Extura) Reloads the currently selected shader",
  "figura.docs.host.first_person_model_set_enabled": "(Extura) Sets whether First Person Model is currently enabled",

  "figura.docs.client.get_mod_version": "(Extura) Get the Version of a mod as a string. Returns an null if mod isn't loaded",
  "figura.docs.client.get_mod_name": "(Extura) Gets the name of a mod as a string. Returns an empty string if the mod isn't loaded",

  "figura.docs.client.get_uuid_from_player": "(Extura) Returns the UUID of a player from their name",
  "figura.docs.client.ping_rate_limit": "(Extura) Returns the amount of pings you can send in a second",
  "figura.docs.client.ping_size_limit": "(Extura) Returns the max size of a ping",
  "figura.docs.client.is_backend_connected": "(Extura) Returns true if using backend is connected.",
  "figura.docs.client.get_current_backend": "(Extura) Returns the current IP being used for the backend, or an empty string if not connected at all.",
  "figura.docs.client.first_person_model_enabled": "(Extura) (DEPRECATED) Gets whether First Person Model is currently enabled",
  "figura.docs.client.first_person_model_is_rendering_player": "(Extura) (DEPRECATED) Gets whether First Person Model is currently rendering - only useful in a RENDER event",
  "figura.docs.client.regex_find": "(Extura) Checks a string against a (Java flavor) Regular Expression and returns true if any matches are found",
  "figura.docs.client.regex_match": "(Extura) Matches a string against a (Java flavor) Regular Expression and returns all matches",
  "figura.docs.client.regex_replace": "(Extura) Matches a string against a (Java flavor) Regular Expression and replaces all matches with a specified string",

  "figura.docs.player.get_destroy_speed": "(Extura) Returns the player's destroy speed for a specific block",
  "figura.docs.player.has_correct_tool_for_drops": "(Extura) Returns if the player's tool can get drops from a specific block",
  "figura.docs.player.can_harm_player": "(Extura) Returns if the player can be harmed by the passed in player",
  "figura.docs.player.is_using_spy_glass": "(Extura) Returns if the player is using a spy glass",
  "figura.docs.player.get_projectile": "(Extura) Returns the player's current projectile for the passed in item",
  "figura.docs.player.get_latency": "(Extura) Returns the player's latency. Returns -1 if unable to get latency",
  "figura.docs.player.get_tablist_display_name": "(Extura) Returns the player's display name on the tab list",
  "figura.docs.player.get_nameplate": "(Extura) Returns the player's nameplate text if they have one, otherwise returns null.\n First argument should be the nameplate type(LIST, CHAT, ENTITY)",
  "figura.docs.living_entity.get_nameplate": "(Extura) Returns the entity's nameplate text if they have one, otherwise returns null.\n First argument should be the nameplate type(LIST, CHAT, ENTITY)",
  "figura.docs.player.can_be_seen_as_enemy": "(Extura) ???",
  "figura.permissions.value.printing": "(Extura) Allow Printing",
  "figura.permissions.value.printing.tooltip": "Allows this avatar to print to chat if Log Others is enabled",

  "figura.docs.extura": "The Extura API",
  "figura.docs.extura.get_figura_setting": "Grabs a Figura setting and returns the value of it",
  "figura.docs.extura.async_lua_function": "Runs specified lua function in a thread. NOTE: VERY UNSTABLE!",
  "figura.docs.extura.httpGet": "Makes an http request to a url",
  "figura.docs.events.processs_script": "The PROCESS_SCRIPT event is run whenever a script is required and a preprocessor is loaded. The script's name and contents are passed as arguments, the script's contents will be replaced with the return value",
  "figura.badges.no_permissions.extura_cheating": "Tried to use Extura's cheating options without OP!",
  "figura.docs.entity.get_curio": "(Extura) Gets an ItemStack for the item in the given Curios slot type\nOptionally accepts a slot ID, indexed at 0",
  "player.get_xp_for_next_level": "(Extura) Gets the amount of experience needed to level up",
  "figura.docs.world.get_map_data": "Takes a string, e.g., `map_3`, and returns a table of data if the map exists.\nMap data may be unsynced, and will only update when holding the map"
}